# Cleaning and Organising Data

In [259]:
import numpy as np
import random
import seaborn as sns
import pandas as pd
import os
import re
%load_ext autoreload
%autoreload 2

The autoreload extension is already loaded. To reload it, use:
  %reload_ext autoreload

In [238]:
!kaggle datasets download -d teajay/global-shark-attacks

Warning: Your Kaggle API key is readable by other users on this system! To fix this, you can run 'chmod 600 /Users/pptrv/.kaggle/kaggle.json'
Downloading global-shark-attacks.zip to /Users/pptrv/IronHack/data-cleaning-pandas
100%|█████████████████████████████████████████| 548k/548k [00:00<00:00, 949kB/s]
100%|█████████████████████████████████████████| 548k/548k [00:00<00:00, 948kB/s]

In [239]:
!tar -xzvf global-shark-attacks.zip

x attacks.csv

In [240]:
!mv attacks.csv ../data-cleaning-pandas/attacks.csv

In [241]:
ls

Analysis.ipynb            README.md                 global-shark-attacks.zip
Clean.ipynb               attacks.csv

In [242]:
!rm -rf global-shark-attacks.zip

In [243]:
pwd

'/Users/pptrv/IronHack/data-cleaning-pandas'

In [244]:
data_ = pd.read_csv('attacks.csv', encoding ='latin1')
data_.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25723 entries, 0 to 25722
Data columns (total 24 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Case Number             8702 non-null   object
 1   Date                    6302 non-null   object
 2   Year                    6300 non-null   float64
 3   Type                    6298 non-null   object
 4   Country                 6252 non-null   object
 5   Area                    5847 non-null   object
 6   Location                5762 non-null   object
 7   Activity                5758 non-null   object
 8   Name                    6092 non-null   object
 9   Sex                     5737 non-null   object
 10  Age                     3471 non-null   object
 11  Injury                  6274 non-null   object
 12  Fatal (Y/N)             5763 non-null   object
 13  Time                    2948 non-null   object
 14  Species                 3464 non-null   object
 15  Investigator or Source  6285 non-null   object
 16  pdf                     6302 non-null   object
 17  href formula            6301 non-null   object
 18  href                    6302 non-null   object
 19  Case Number.1           6302 non-null   object
 20  Case Number.2           6302 non-null   object
 21  original order          6309 non-null   float64
 22  Unnamed: 22             1 non-null      object
 23  Unnamed: 23             2 non-null      object
dtypes: float64(2), object(22)
memory usage: 4.7+ MB

Five different techniques to clean data:

1rst technique : Our Dataset

First we create a new dataset with the columns we need from dataset_1. I have selected "Case Number" as it provides with dates as an int. I have also selected Country as it will allow as to figure out if the attack ouccured in the northern of southern hemisphere.

In [245]:
data_1 = data_[['Case Number', 'Country']]
data_1.head()

  Case Number    Country
0  2018.06.25        USA
1  2018.06.18        USA
2  2018.06.09        USA
3  2018.06.08  AUSTRALIA
4  2018.06.04     MEXICO

2nd Technique: Changin column name.

We have decided to use the Case Number column as dates, as they contain less nulls and we may transform to a integer easily.

In [246]:
data_2 = data_1.rename(columns={'Case Number': 'Dates'})
data_2.head()

        Dates    Country
0  2018.06.25        USA
1  2018.06.18        USA
2  2018.06.09        USA
3  2018.06.08  AUSTRALIA
4  2018.06.04     MEXICO

3rd technique: No strings in "Dates"

I will standarize dates by eliminating the .(string) at the end of the objects.

In [247]:
data_2['Dates'] = data_2['Dates'].str.replace(r'\D', '')
data_3 = data_2
data_3.sample(10)

          Dates       Country
10307       NaN           NaN
12342       NaN           NaN
19342       NaN           NaN
7663          0           NaN
10315       NaN           NaN
3856   19620106  SOUTH AFRICA
15114       NaN           NaN
7890          0           NaN
3361   19710630  SOUTH AFRICA
25382       NaN           NaN

4rth technique: Eliminating NaN rows

Will provide us with enough data to figure out our hipothesis, and not contaminmating our results with incomplete data.

In [248]:
data_4 = data_3.dropna() 
data_4.info()
data_4.sample(10)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6251 entries, 0 to 6301
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Dates    6251 non-null   object
 1   Country  6251 non-null   object
dtypes: object(2)
memory usage: 146.5+ KB

         Dates        Country
1585  20050527            USA
2128  19990318    NEW ZEALAND
3211  19750809            USA
3220  19750705      AUSTRALIA
1187  20081200     MOZAMBIQUE
4793  19390718  PACIFIC OCEAN
4910  19350425      AUSTRALIA
4046  19591116            USA
3525  19670600          ITALY
1735  20031005            USA

5th Technique: Only using dates that include "year, month and day"

In [250]:
data_4['Dates'] = data_4['Dates'].str.extract(r'^(\d{8})')
data_4.sample(20)

<ipython-input-250-4922b36f3907>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data_4['Dates'] = data_4['Dates'].str.extract(r'^(\d{8})')

         Dates           Country
1365  20070704           REUNION
791   20120529            MEXICO
2990  19820214               USA
3887  19610729               USA
4116  19590115      SOUTH AFRICA
38    20180309         AUSTRALIA
134   20170610         AUSTRALIA
4230  19560923               USA
1587  20050515         AUSTRALIA
4797  19390412  PAPUA NEW GUINEA
4840  19370911          SCOTLAND
1630  20041021         AUSTRALIA
56    20171209           BAHAMAS
4096  19590503               USA
2471  19930926      SOUTH AFRICA
4567  19471100         AUSTRALIA
1989  20001120         AUSTRALIA
4364  19530920               USA
5778  18840116      SOUTH AFRICA
2994  19820207               USA

6th technique: New column for the season

Although it would be necesary to create a new dataframe for countries and their latitude, to compare with data_4 to know the real hemisphere os each attack and be able to separate the northen summers in August vs southern hemisphere summers in december. I will simply, although it is not correct, by creating a new column of the season wrongly standarizing the season no matter the hemisphere. The days for each season will be: 
  Winter : xxxx/01/01 to xxxx/03/31
  Spring : xxxx/04/01 to xxxx/06/31
  Summer : xxxx/07/01 to xxxx/09/31
  Fall : xxxx/10/01 to xxxx/12/31

In [258]:
data_4["Season"] = data_4['Dates'].between(0101,0331 of 4 last digits, append(Winter))
add this for the rest of season.

TypeError: read_excel() got an unexpected keyword argument 'encoding'

Cleaned dataset: